import React, { useState, useEffect } from 'react'
import { Link, useParams } from 'react-router-dom'
import './Product.css'
// import { useLogin } from '../../components/Authorization/Context'
// import { useMutation, useQuery } from '@apollo/client'
// import { 
//         KORZINKA,
//         RECOMMENDED, 
//         TOVAR, 
//         BY_TOVAR_ID, 
//         CREATE_OTZIV,  
//         FIRST_STAR,
//         SECOND_STAR,
//         THIRD_STAR,
//         FOURTH_STAR,
//         FIVE_STAR,
//         ALL_COUNT,
//         COUNT
//      } from './Query'
// import moment from 'moment'
// import 'moment/locale/ru'
import xudbig from './images/bigxudtovar.png'
import z1 from './images/z1.png'
import profcomphoto from './images/profcomphoto.png'
import adbacha from './images/adbacha.png'
import OtzivModal from '../../Modals/OtzivModal'


function Product () {
    const [show,setShow] = useState(false)

    // const [ state, setState ] = useState(1)

    // const [ linkNumber, setLinkNumber ] = useState(1)

    // const [ rate, setRate ] = useState("0")

    // const [ comment, setComment ] = useState('')

    // const [ tovarId, setTovarId ] = useState("")

    // const [ disabled, setDisabled ] = useState(true)

    // const [ modal, setModal ] = useState("#addModal")

    // const [ otzModal, setOtzModal ] = useState("#closeOtziv")

    // const [ limit ] = useState(5)

    // const [ page, setPage ] = useState(1)

    // const [ length, setLength ] = useState(0)

    // const [ token ] = useLogin()

    // const { id } = useParams()
      
    // const status = parseInt(id)
    
    // const { data, networkStatus, error  } = useQuery(TOVAR, {
    //     variables: {linkNumber}
    // })

    // const [korzinka, { loading: korzinkaLoading, error: korzinkaError }] = useMutation(KORZINKA, {
    //     update: () => {}
    // })

    // const [createOtziv, { loading: otzivLoading, error: otzivError } ] = useMutation(CREATE_OTZIV, {
    //     update: () => {}
    // })

    // const { data: recommendData, networkStatus: recomendNetworkStatus, error: recommendError } = useQuery(RECOMMENDED)

    // const { data: subData, networkStatus: subNetworkStatus, error: subError } = useQuery(BY_TOVAR_ID, {
    //     variables: { tovarId, page, limit}
    // })

    // const { data: star1, networkStatus: star1NetworkStatus, error: star1Error } = useQuery(FIRST_STAR, {
    //     variables: { tovarId }
    // })

    // const { data: star2, networkStatus: star2NetworkStatus, error: star2Error } = useQuery(SECOND_STAR, {
    //     variables: { tovarId }
    // })

    // const { data: star3, networkStatus: star3NetworkStatus, error: star3Error } = useQuery(THIRD_STAR, {
    //     variables: { tovarId }
    // })

    // const { data: star4, networkStatus: star4NetworkStatus, error: star4Error } = useQuery(FOURTH_STAR, {
    //     variables: { tovarId }
    // })

    // const { data: star5, networkStatus: star5NetworkStatus, error: star5Error } = useQuery(FIVE_STAR, {
    //     variables: { tovarId }
    // })

    // const { data: allOtziv, networkStatus: allOtzivNetworkStatus, error: allOtzivError } = useQuery(ALL_COUNT, {
    //     variables: { tovarId }
    // })

    // const { data: countData, networkStatus: countNetworkStatus, error: countError } = useQuery(COUNT, {
    //     variables: { limit, tovarId }
    // })

    // useEffect(() => {
    //     comment.length <= 0 ||
    //     rate <= "0" 
    //      ? setDisabled(true) : setDisabled(false)
    // }, [rate, comment])

    // useEffect(() => {
    //     if(state === 1) {
    //         setDisabled(true)
    //     }
    //     else {
    //         setDisabled(false)
    //     }
    // }, [state])

    // useEffect(() => {

    //     if(status) {
    //         setLinkNumber(status)
    //     }
        
    // }, [status])

    // useEffect(() => {
    //     if(data) {
    //         for(let i of data.tovarlarDetails) {
    //             setTovarId(i.tovarId)
    //         }
    //     }

    // }, [data])

    // useEffect(() => {

    //     if(subData) {
    //         if(subData.byTovarId.length >= 5) {
    //             setLength(1)
    //         }
    //     }

    //     console.log(length)

    // }, [subData])

    // const button = e => {
    //     e.preventDefault()

    //     const productID = e.target.id
    //     const productCount = parseInt(state)
    //     const productSum = parseInt(e.target.value)

    //     if(!token) {
    //       setModal("#tokenModal") 
    //     }
    //     else {
    //       korzinka({
    //         variables: {
    //           productID,
    //           productCount,
    //           productSum
    //         }
    //       })
    //     }
    // }

    // const see = e => {
    //     e.preventDefault()

    //    if(e.target.value) {
    //        window.location.href = e.target.value
    //    }
    // }

    // const submitOtziv = e => {
    //     e.preventDefault()

    //     if(!token) {
    //         setOtzModal("#tokenModal")
    //     }
    //     else {
    //         createOtziv({
    //             variables: {
    //                 body: comment,
    //                 rate: parseInt(rate),
    //                 tovarId
    //             }
    //         })
    //     }
    // }

    // const btn1 = e => {
        
    //     setState(state - 1)
    // }
    
    // const btn2 = e => {
    
    //     setState(state + 1)
    // }

    // const addKorzinka = e => {

    //     e.preventDefault()

    //     const productID = e.target.id
    //     const productSum = parseInt(e.target.value)

    //     const productCount = 1

    //     if(!token) {
    //         setModal("#tokenModal")
    //     }
    //     else {
    //         korzinka({
    //             variables: {
    //                 productID,
    //                 productCount,
    //                 productSum
    //             }
    //         })
    //     }
    // }

    // if(otzivLoading) return <>loading</>
    // if(otzivError) return <>error</>

    return (
        <>
        <div className="mainproduct-container">
                <div className="xudtovar-container">
                    <div className="xudtovar-text">
                        <div className="cabinet-line">
                            <Link to="/categories/books">Книги /</Link>
                            <Link to="/categories/books/worldbooks">  Узбеская литература</Link>
                        </div>
                    </div>
                        <div className="xudtovar-content">
                            <div className="xudbig-img">
                                <img src={xudbig} alt=""/>
                            </div>
                            <div className="xuddesc-container">
                                <h3>Stiven Xoaking </h3>
                                <div className="xudtovar-rank">
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.55123 10.6992L8.26603 10.5011L7.98082 10.6992L4.17904 13.3394C4.17901 13.3394 4.17898 13.3395 4.17895 13.3395C4.01781 13.4513 3.91323 13.4886 3.85592 13.4976C3.81908 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.76681 13.468C3.76578 13.4664 3.76233 13.4609 3.75969 13.4458C3.75349 13.4104 3.75225 13.3198 3.81414 13.1499L3.81418 13.1499L3.81615 13.1443L5.30194 8.90952L5.4291 8.54709L5.11169 8.3308L1.28249 5.72158L1.28232 5.72146C1.12229 5.61251 1.05951 5.53286 1.03896 5.49445C1.03553 5.48804 1.03371 5.48361 1.03279 5.48097C1.03316 5.47956 1.03375 5.47759 1.03469 5.47497L1.0347 5.47497L1.03562 5.47234C1.03579 5.47185 1.03596 5.47135 1.03613 5.47082C1.03856 5.46349 1.04204 5.45294 1.07692 5.43572C1.1276 5.41069 1.23561 5.37981 1.43262 5.38191L1.43519 5.38192L6.13291 5.40781L6.49378 5.4098L6.60934 5.06792L8.04597 0.817586L8.04638 0.816375C8.1053 0.640554 8.16483 0.559589 8.1996 0.526632C8.22219 0.50523 8.23568 0.5 8.26603 0.5C8.29638 0.5 8.30987 0.50523 8.33245 0.526632C8.36723 0.559589 8.42675 0.640554 8.48568 0.816376L8.48609 0.817585L9.92272 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4927 5.46134 15.4959 5.47081C15.4961 5.47132 15.4963 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4726 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                    </svg>
                                    <span>Отзывы 15</span>
                                </div>
                                <div className="shorttovar-desc">
                                    <h4>Коротко о товаре</h4>
                                    <div className="detail-tovar">
                                        <div className="each-detail">
                                            <p>Автор</p>
                                            <span>-------------------------</span>
                                            <h5>Stiven Xoaking</h5>
                                        </div>
                                        <div className="each-detail">
                                            <p>Языки</p>
                                            <span>-------------------------</span>
                                            <h5>Rus</h5>
                                        </div>
                                        <div className="each-detail">
                                            <p>Надпись</p>
                                            <span>-------------------------</span>
                                            <h5>Кириллица</h5>
                                        </div>
                                        <div className="each-detail">
                                            <p>Издательство</p>
                                            <span>-------------------------</span>
                                            <h5>1999</h5>
                                        </div>
                                    </div>
                                    <div className="xudamount-content">
                                        <p>Количество:</p>
                                        <div className="btn-amount">
                                            <button>-</button>
                                            <span>1</span>
                                            <button>+</button>
                                        </div>
                                    </div>
                                    <div className="xudtovar-price">
                                        <h3>100 000 сум</h3>
                                    </div>
                                    <div className="xudtovar-button">
                                        <button>В корзину</button>
                                    </div>
                                    <div className="dosuzb">
                                        <svg width="15" height="12" viewBox="0 0 15 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M1.04822 7.40947L1.22438 7.23331L1.04822 7.40947L4.26361 10.6249C4.66124 11.0225 5.30415 11.0225 5.70178 10.6249L13.8402 2.48639C14.2379 2.08876 14.2379 1.44585 13.8402 1.04822C13.4426 0.650592 12.7997 0.650592 12.4021 1.04822L4.97894 8.46384L2.48639 5.9713C2.08876 5.57367 1.44585 5.57367 1.04822 5.9713C0.650592 6.36893 0.650592 7.01184 1.04822 7.40947Z" fill="#27AE60" stroke="#27AE60" strokeWidth="0.5"/>
                                        </svg>
                                        <h4>Доставка по Узбекистану</h4>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div className="opisan-book">
                            <h3>Описание</h3>
                            <span>Молодость быстро и обычно незаметно проходит. Большинство берутся за ум после 30-ти, когда тело дряхлеет, ум слабеет, а в кармане пусто. Между тем есть иные перспективы для сегодняшних 10-15-летних. Обычно мы не понимаем, что такое лидерство и не стремимся к этому, а потому большинство коротают судьбу вагона, прицепленного к локомотиву чужой жизни. Изучить основы лидерства и понять его принципы - хорошая возможность взять жизнь в собственные руки, реализовать возможности стоимостью триллионы долларов, бесстрашно созидая и получая от процесса огромное удовольствие. Гарантирую.</span>
                            <div className="xarak-book">
                                <h3>Характеристики</h3>
                                <div className="xarak-content">
                                    <div className="xarak-box">
                                        <div className="each-xarak">
                                            <p>Автор</p>
                                            <span>------------------------</span>
                                            <h5>Stiven Xoaking</h5>
                                        </div>
                                        <div className="each-xarak">
                                            <p>Языки</p>
                                            <span>------------------------</span>
                                            <h5>Rus</h5>
                                        </div>
                                        <div className="each-xarak">
                                            <p>Надпись</p>
                                            <span>------------------------</span>
                                            <h5>Кириллица</h5>
                                        </div>
                                        <div className="each-xarak">
                                            <p>Год выпуска</p>
                                            <span>------------------------</span>
                                            <h5>1988</h5>
                                        </div>
                                        <div className="each-xarak">
                                            <p>Количество листов</p>
                                            <span>------------------------</span>
                                            <h5>233</h5>
                                        </div>
                                    </div>
                                </div>
                                <h4>Информация о технических характеристиках, комплекте поставки, стране изготовления, внешнем виде и цвете товара носит справочный характер и основывается на последних доступных к моменту публикации сведениях</h4>
                            </div>
                        </div>
                </div>
                <div className="smotr-book">
                    <div className="smotrbook-text">
                        <h3>С этим товаром смотрят</h3>
                    </div>
                        <hr/>
                    <div className="smotr-container">
                        <div className="single-smotr">
                            <div className="imgwith-sale">
                                <img src={z1} alt=""/>
                                <div className="overlay-img">
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M8.10382 5.59082C7.01432 5.59082 6.12891 6.44672 6.12891 7.4999C6.12891 8.55309 7.01432 9.40899 8.10382 9.40899C9.19333 9.40899 10.0787 8.55309 10.0787 7.4999C10.0787 6.44672 9.1933 5.59082 8.10382 5.59082Z" fill="white"/>
                                            <path d="M8.1037 2.72705C4.81215 2.72705 2.00119 4.70612 0.862305 7.49978C2.00119 10.2934 4.81215 12.2725 8.1037 12.2725C11.3985 12.2725 14.2062 10.2934 15.3451 7.49978C14.2062 4.70612 11.3985 2.72705 8.1037 2.72705ZM8.1037 10.6816C6.28677 10.6816 4.81215 9.25612 4.81215 7.49975C4.81215 5.74339 6.28677 4.31795 8.1037 4.31795C9.92063 4.31795 11.3952 5.74342 11.3952 7.49978C11.3952 9.25615 9.92063 10.6816 8.1037 10.6816Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M3.63854 14.3951C3.88405 14.5763 4.1807 14.5194 4.54384 14.2502L8.10368 11.6099L11.6635 14.2502C12.0267 14.5194 12.3284 14.5763 12.5688 14.3951C12.8041 14.2139 12.8604 13.9137 12.7172 13.4788L11.3208 9.24399L14.9063 6.63477C15.2694 6.37074 15.4126 6.09636 15.3154 5.80645C15.2234 5.52689 14.9574 5.37676 14.4971 5.38193L10.0984 5.40782L8.75325 1.15748C8.61516 0.717435 8.40034 0.5 8.10368 0.5C7.80703 0.5 7.59221 0.717435 7.45412 1.15748L6.10895 5.40782L1.71029 5.38193C1.25508 5.37676 0.984005 5.52689 0.89194 5.80645C0.79476 6.09636 0.937972 6.37074 1.30112 6.63477L4.88653 9.24399L3.49533 13.4788C3.347 13.9137 3.40326 14.2139 3.63854 14.3951Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M12.5447 4.82136V3.25332C12.5447 2.24474 11.7122 1.42383 10.6689 1.42383H5.55497C4.51161 1.42383 3.66209 2.24444 3.66209 3.25332V4.82107H1.68588C1.23105 4.82107 0.862305 5.17752 0.862305 5.61719V7.34783C0.862305 7.78779 1.23105 8.14395 1.68588 8.14395H1.9313L2.83119 12.9227C2.90231 13.301 3.24359 13.576 3.64133 13.576H12.5828C12.9809 13.576 13.3215 13.301 13.393 12.9224L14.2922 8.14395H14.5212C14.976 8.14395 15.3448 7.78779 15.3448 7.34783V5.61719C15.3448 5.17752 14.976 4.82107 14.5212 4.82107L12.5447 4.82136ZM5.18775 3.25332C5.18775 3.06092 5.35594 2.89863 5.55497 2.89863H10.6698C10.8685 2.89863 11.0196 3.06092 11.0196 3.25332V4.82107H5.18775V3.25332ZM6.32696 10.7309C6.32696 11.0369 6.0739 11.2848 5.75735 11.2848C5.44111 11.2848 5.18775 11.0369 5.18775 10.7309V7.69041C5.18775 7.38441 5.44111 7.13684 5.75735 7.13684C6.0742 7.13684 6.32696 7.385 6.32696 7.69041V10.7309ZM8.6829 10.7309C8.6829 11.0369 8.42954 11.2848 8.1133 11.2848C7.79706 11.2848 7.54339 11.0369 7.54339 10.7309V7.69041C7.54339 7.38441 7.79706 7.13684 8.1133 7.13684C8.42985 7.13684 8.6829 7.385 8.6829 7.69041V10.7309ZM11.0389 10.7309C11.0389 11.0369 10.7855 11.2848 10.4696 11.2848C10.153 11.2848 9.89964 11.0369 9.89964 10.7309V7.69041C9.89964 7.38441 10.153 7.13684 10.4696 7.13684C10.7855 7.13684 11.0389 7.385 11.0389 7.69041V10.7309Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14.0003" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                            <h5>Книги</h5>
                            <h4>Stiven Xoaking</h4>
                            <h3>100 000 сум</h3>
                        </div>
                        <div className="single-smotr">
                            <div className="imgwith-sale">
                                <img src={z1} alt=""/>
                                <div className="overlay-img">
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M8.10382 5.59082C7.01432 5.59082 6.12891 6.44672 6.12891 7.4999C6.12891 8.55309 7.01432 9.40899 8.10382 9.40899C9.19333 9.40899 10.0787 8.55309 10.0787 7.4999C10.0787 6.44672 9.1933 5.59082 8.10382 5.59082Z" fill="white"/>
                                            <path d="M8.1037 2.72705C4.81215 2.72705 2.00119 4.70612 0.862305 7.49978C2.00119 10.2934 4.81215 12.2725 8.1037 12.2725C11.3985 12.2725 14.2062 10.2934 15.3451 7.49978C14.2062 4.70612 11.3985 2.72705 8.1037 2.72705ZM8.1037 10.6816C6.28677 10.6816 4.81215 9.25612 4.81215 7.49975C4.81215 5.74339 6.28677 4.31795 8.1037 4.31795C9.92063 4.31795 11.3952 5.74342 11.3952 7.49978C11.3952 9.25615 9.92063 10.6816 8.1037 10.6816Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M3.63854 14.3951C3.88405 14.5763 4.1807 14.5194 4.54384 14.2502L8.10368 11.6099L11.6635 14.2502C12.0267 14.5194 12.3284 14.5763 12.5688 14.3951C12.8041 14.2139 12.8604 13.9137 12.7172 13.4788L11.3208 9.24399L14.9063 6.63477C15.2694 6.37074 15.4126 6.09636 15.3154 5.80645C15.2234 5.52689 14.9574 5.37676 14.4971 5.38193L10.0984 5.40782L8.75325 1.15748C8.61516 0.717435 8.40034 0.5 8.10368 0.5C7.80703 0.5 7.59221 0.717435 7.45412 1.15748L6.10895 5.40782L1.71029 5.38193C1.25508 5.37676 0.984005 5.52689 0.89194 5.80645C0.79476 6.09636 0.937972 6.37074 1.30112 6.63477L4.88653 9.24399L3.49533 13.4788C3.347 13.9137 3.40326 14.2139 3.63854 14.3951Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M12.5447 4.82136V3.25332C12.5447 2.24474 11.7122 1.42383 10.6689 1.42383H5.55497C4.51161 1.42383 3.66209 2.24444 3.66209 3.25332V4.82107H1.68588C1.23105 4.82107 0.862305 5.17752 0.862305 5.61719V7.34783C0.862305 7.78779 1.23105 8.14395 1.68588 8.14395H1.9313L2.83119 12.9227C2.90231 13.301 3.24359 13.576 3.64133 13.576H12.5828C12.9809 13.576 13.3215 13.301 13.393 12.9224L14.2922 8.14395H14.5212C14.976 8.14395 15.3448 7.78779 15.3448 7.34783V5.61719C15.3448 5.17752 14.976 4.82107 14.5212 4.82107L12.5447 4.82136ZM5.18775 3.25332C5.18775 3.06092 5.35594 2.89863 5.55497 2.89863H10.6698C10.8685 2.89863 11.0196 3.06092 11.0196 3.25332V4.82107H5.18775V3.25332ZM6.32696 10.7309C6.32696 11.0369 6.0739 11.2848 5.75735 11.2848C5.44111 11.2848 5.18775 11.0369 5.18775 10.7309V7.69041C5.18775 7.38441 5.44111 7.13684 5.75735 7.13684C6.0742 7.13684 6.32696 7.385 6.32696 7.69041V10.7309ZM8.6829 10.7309C8.6829 11.0369 8.42954 11.2848 8.1133 11.2848C7.79706 11.2848 7.54339 11.0369 7.54339 10.7309V7.69041C7.54339 7.38441 7.79706 7.13684 8.1133 7.13684C8.42985 7.13684 8.6829 7.385 8.6829 7.69041V10.7309ZM11.0389 10.7309C11.0389 11.0369 10.7855 11.2848 10.4696 11.2848C10.153 11.2848 9.89964 11.0369 9.89964 10.7309V7.69041C9.89964 7.38441 10.153 7.13684 10.4696 7.13684C10.7855 7.13684 11.0389 7.385 11.0389 7.69041V10.7309Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14.0003" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                            <h5>Книги</h5>
                            <h4>Stiven Xoaking</h4>
                            <h3>100 000 сум</h3>
                        </div>
                        <div className="single-smotr">
                            <div className="imgwith-sale">
                                <img src={z1} alt=""/>
                                <div className="overlay-img">
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M8.10382 5.59082C7.01432 5.59082 6.12891 6.44672 6.12891 7.4999C6.12891 8.55309 7.01432 9.40899 8.10382 9.40899C9.19333 9.40899 10.0787 8.55309 10.0787 7.4999C10.0787 6.44672 9.1933 5.59082 8.10382 5.59082Z" fill="white"/>
                                            <path d="M8.1037 2.72705C4.81215 2.72705 2.00119 4.70612 0.862305 7.49978C2.00119 10.2934 4.81215 12.2725 8.1037 12.2725C11.3985 12.2725 14.2062 10.2934 15.3451 7.49978C14.2062 4.70612 11.3985 2.72705 8.1037 2.72705ZM8.1037 10.6816C6.28677 10.6816 4.81215 9.25612 4.81215 7.49975C4.81215 5.74339 6.28677 4.31795 8.1037 4.31795C9.92063 4.31795 11.3952 5.74342 11.3952 7.49978C11.3952 9.25615 9.92063 10.6816 8.1037 10.6816Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M3.63854 14.3951C3.88405 14.5763 4.1807 14.5194 4.54384 14.2502L8.10368 11.6099L11.6635 14.2502C12.0267 14.5194 12.3284 14.5763 12.5688 14.3951C12.8041 14.2139 12.8604 13.9137 12.7172 13.4788L11.3208 9.24399L14.9063 6.63477C15.2694 6.37074 15.4126 6.09636 15.3154 5.80645C15.2234 5.52689 14.9574 5.37676 14.4971 5.38193L10.0984 5.40782L8.75325 1.15748C8.61516 0.717435 8.40034 0.5 8.10368 0.5C7.80703 0.5 7.59221 0.717435 7.45412 1.15748L6.10895 5.40782L1.71029 5.38193C1.25508 5.37676 0.984005 5.52689 0.89194 5.80645C0.79476 6.09636 0.937972 6.37074 1.30112 6.63477L4.88653 9.24399L3.49533 13.4788C3.347 13.9137 3.40326 14.2139 3.63854 14.3951Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M12.5447 4.82136V3.25332C12.5447 2.24474 11.7122 1.42383 10.6689 1.42383H5.55497C4.51161 1.42383 3.66209 2.24444 3.66209 3.25332V4.82107H1.68588C1.23105 4.82107 0.862305 5.17752 0.862305 5.61719V7.34783C0.862305 7.78779 1.23105 8.14395 1.68588 8.14395H1.9313L2.83119 12.9227C2.90231 13.301 3.24359 13.576 3.64133 13.576H12.5828C12.9809 13.576 13.3215 13.301 13.393 12.9224L14.2922 8.14395H14.5212C14.976 8.14395 15.3448 7.78779 15.3448 7.34783V5.61719C15.3448 5.17752 14.976 4.82107 14.5212 4.82107L12.5447 4.82136ZM5.18775 3.25332C5.18775 3.06092 5.35594 2.89863 5.55497 2.89863H10.6698C10.8685 2.89863 11.0196 3.06092 11.0196 3.25332V4.82107H5.18775V3.25332ZM6.32696 10.7309C6.32696 11.0369 6.0739 11.2848 5.75735 11.2848C5.44111 11.2848 5.18775 11.0369 5.18775 10.7309V7.69041C5.18775 7.38441 5.44111 7.13684 5.75735 7.13684C6.0742 7.13684 6.32696 7.385 6.32696 7.69041V10.7309ZM8.6829 10.7309C8.6829 11.0369 8.42954 11.2848 8.1133 11.2848C7.79706 11.2848 7.54339 11.0369 7.54339 10.7309V7.69041C7.54339 7.38441 7.79706 7.13684 8.1133 7.13684C8.42985 7.13684 8.6829 7.385 8.6829 7.69041V10.7309ZM11.0389 10.7309C11.0389 11.0369 10.7855 11.2848 10.4696 11.2848C10.153 11.2848 9.89964 11.0369 9.89964 10.7309V7.69041C9.89964 7.38441 10.153 7.13684 10.4696 7.13684C10.7855 7.13684 11.0389 7.385 11.0389 7.69041V10.7309Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14.0003" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                            <h5>Книги</h5>
                            <h4>Stiven Xoaking</h4>
                            <h3>100 000 сум</h3>
                        </div>
                        <div className="single-smotr">
                            <div className="imgwith-sale">
                                <img src={z1} alt=""/>
                                <div className="overlay-img">
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M8.10382 5.59082C7.01432 5.59082 6.12891 6.44672 6.12891 7.4999C6.12891 8.55309 7.01432 9.40899 8.10382 9.40899C9.19333 9.40899 10.0787 8.55309 10.0787 7.4999C10.0787 6.44672 9.1933 5.59082 8.10382 5.59082Z" fill="white"/>
                                            <path d="M8.1037 2.72705C4.81215 2.72705 2.00119 4.70612 0.862305 7.49978C2.00119 10.2934 4.81215 12.2725 8.1037 12.2725C11.3985 12.2725 14.2062 10.2934 15.3451 7.49978C14.2062 4.70612 11.3985 2.72705 8.1037 2.72705ZM8.1037 10.6816C6.28677 10.6816 4.81215 9.25612 4.81215 7.49975C4.81215 5.74339 6.28677 4.31795 8.1037 4.31795C9.92063 4.31795 11.3952 5.74342 11.3952 7.49978C11.3952 9.25615 9.92063 10.6816 8.1037 10.6816Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M3.63854 14.3951C3.88405 14.5763 4.1807 14.5194 4.54384 14.2502L8.10368 11.6099L11.6635 14.2502C12.0267 14.5194 12.3284 14.5763 12.5688 14.3951C12.8041 14.2139 12.8604 13.9137 12.7172 13.4788L11.3208 9.24399L14.9063 6.63477C15.2694 6.37074 15.4126 6.09636 15.3154 5.80645C15.2234 5.52689 14.9574 5.37676 14.4971 5.38193L10.0984 5.40782L8.75325 1.15748C8.61516 0.717435 8.40034 0.5 8.10368 0.5C7.80703 0.5 7.59221 0.717435 7.45412 1.15748L6.10895 5.40782L1.71029 5.38193C1.25508 5.37676 0.984005 5.52689 0.89194 5.80645C0.79476 6.09636 0.937972 6.37074 1.30112 6.63477L4.88653 9.24399L3.49533 13.4788C3.347 13.9137 3.40326 14.2139 3.63854 14.3951Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M12.5447 4.82136V3.25332C12.5447 2.24474 11.7122 1.42383 10.6689 1.42383H5.55497C4.51161 1.42383 3.66209 2.24444 3.66209 3.25332V4.82107H1.68588C1.23105 4.82107 0.862305 5.17752 0.862305 5.61719V7.34783C0.862305 7.78779 1.23105 8.14395 1.68588 8.14395H1.9313L2.83119 12.9227C2.90231 13.301 3.24359 13.576 3.64133 13.576H12.5828C12.9809 13.576 13.3215 13.301 13.393 12.9224L14.2922 8.14395H14.5212C14.976 8.14395 15.3448 7.78779 15.3448 7.34783V5.61719C15.3448 5.17752 14.976 4.82107 14.5212 4.82107L12.5447 4.82136ZM5.18775 3.25332C5.18775 3.06092 5.35594 2.89863 5.55497 2.89863H10.6698C10.8685 2.89863 11.0196 3.06092 11.0196 3.25332V4.82107H5.18775V3.25332ZM6.32696 10.7309C6.32696 11.0369 6.0739 11.2848 5.75735 11.2848C5.44111 11.2848 5.18775 11.0369 5.18775 10.7309V7.69041C5.18775 7.38441 5.44111 7.13684 5.75735 7.13684C6.0742 7.13684 6.32696 7.385 6.32696 7.69041V10.7309ZM8.6829 10.7309C8.6829 11.0369 8.42954 11.2848 8.1133 11.2848C7.79706 11.2848 7.54339 11.0369 7.54339 10.7309V7.69041C7.54339 7.38441 7.79706 7.13684 8.1133 7.13684C8.42985 7.13684 8.6829 7.385 8.6829 7.69041V10.7309ZM11.0389 10.7309C11.0389 11.0369 10.7855 11.2848 10.4696 11.2848C10.153 11.2848 9.89964 11.0369 9.89964 10.7309V7.69041C9.89964 7.38441 10.153 7.13684 10.4696 7.13684C10.7855 7.13684 11.0389 7.385 11.0389 7.69041V10.7309Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14.0003" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                            <h5>Книги</h5>
                            <h4>Stiven Xoaking</h4>
                            <h3>100 000 сум</h3>
                        </div>
                        <div className="single-smotr">
                            <div className="imgwith-sale">
                                <img src={z1} alt=""/>
                                <div className="overlay-img">
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M8.10382 5.59082C7.01432 5.59082 6.12891 6.44672 6.12891 7.4999C6.12891 8.55309 7.01432 9.40899 8.10382 9.40899C9.19333 9.40899 10.0787 8.55309 10.0787 7.4999C10.0787 6.44672 9.1933 5.59082 8.10382 5.59082Z" fill="white"/>
                                            <path d="M8.1037 2.72705C4.81215 2.72705 2.00119 4.70612 0.862305 7.49978C2.00119 10.2934 4.81215 12.2725 8.1037 12.2725C11.3985 12.2725 14.2062 10.2934 15.3451 7.49978C14.2062 4.70612 11.3985 2.72705 8.1037 2.72705ZM8.1037 10.6816C6.28677 10.6816 4.81215 9.25612 4.81215 7.49975C4.81215 5.74339 6.28677 4.31795 8.1037 4.31795C9.92063 4.31795 11.3952 5.74342 11.3952 7.49978C11.3952 9.25615 9.92063 10.6816 8.1037 10.6816Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M3.63854 14.3951C3.88405 14.5763 4.1807 14.5194 4.54384 14.2502L8.10368 11.6099L11.6635 14.2502C12.0267 14.5194 12.3284 14.5763 12.5688 14.3951C12.8041 14.2139 12.8604 13.9137 12.7172 13.4788L11.3208 9.24399L14.9063 6.63477C15.2694 6.37074 15.4126 6.09636 15.3154 5.80645C15.2234 5.52689 14.9574 5.37676 14.4971 5.38193L10.0984 5.40782L8.75325 1.15748C8.61516 0.717435 8.40034 0.5 8.10368 0.5C7.80703 0.5 7.59221 0.717435 7.45412 1.15748L6.10895 5.40782L1.71029 5.38193C1.25508 5.37676 0.984005 5.52689 0.89194 5.80645C0.79476 6.09636 0.937972 6.37074 1.30112 6.63477L4.88653 9.24399L3.49533 13.4788C3.347 13.9137 3.40326 14.2139 3.63854 14.3951Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                    <button>
                                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                            <path d="M12.5447 4.82136V3.25332C12.5447 2.24474 11.7122 1.42383 10.6689 1.42383H5.55497C4.51161 1.42383 3.66209 2.24444 3.66209 3.25332V4.82107H1.68588C1.23105 4.82107 0.862305 5.17752 0.862305 5.61719V7.34783C0.862305 7.78779 1.23105 8.14395 1.68588 8.14395H1.9313L2.83119 12.9227C2.90231 13.301 3.24359 13.576 3.64133 13.576H12.5828C12.9809 13.576 13.3215 13.301 13.393 12.9224L14.2922 8.14395H14.5212C14.976 8.14395 15.3448 7.78779 15.3448 7.34783V5.61719C15.3448 5.17752 14.976 4.82107 14.5212 4.82107L12.5447 4.82136ZM5.18775 3.25332C5.18775 3.06092 5.35594 2.89863 5.55497 2.89863H10.6698C10.8685 2.89863 11.0196 3.06092 11.0196 3.25332V4.82107H5.18775V3.25332ZM6.32696 10.7309C6.32696 11.0369 6.0739 11.2848 5.75735 11.2848C5.44111 11.2848 5.18775 11.0369 5.18775 10.7309V7.69041C5.18775 7.38441 5.44111 7.13684 5.75735 7.13684C6.0742 7.13684 6.32696 7.385 6.32696 7.69041V10.7309ZM8.6829 10.7309C8.6829 11.0369 8.42954 11.2848 8.1133 11.2848C7.79706 11.2848 7.54339 11.0369 7.54339 10.7309V7.69041C7.54339 7.38441 7.79706 7.13684 8.1133 7.13684C8.42985 7.13684 8.6829 7.385 8.6829 7.69041V10.7309ZM11.0389 10.7309C11.0389 11.0369 10.7855 11.2848 10.4696 11.2848C10.153 11.2848 9.89964 11.0369 9.89964 10.7309V7.69041C9.89964 7.38441 10.153 7.13684 10.4696 7.13684C10.7855 7.13684 11.0389 7.385 11.0389 7.69041V10.7309Z" fill="white"/>
                                            </g>
                                            <defs>
                                            <clipPath id="clip0">
                                            <rect width="14.4828" height="14.0003" fill="white" transform="translate(0.862305 0.5)"/>
                                            </clipPath>
                                            </defs>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                            <h5>Книги</h5>
                            <h4>Stiven Xoaking</h4>
                            <h3>100 000 сум</h3>
                        </div>
                    </div>
                </div>
                <div className="otziv-text">
                    <h3>Отзывы</h3>
                </div>
                <div className="otziv-container">
                    <div className="comment-container">
                        <div className="otziv-comments">
                            <div className="single-comment">
                                <div className="otzimage-container">
                                    <img src={profcomphoto} alt=""/>
                                </div>
                                <div className="cominfo">
                                    <h3>Baxtiyor</h3>
                                    <div className="rate-com">
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                    </svg>
                                    <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                    </svg>
                                    </div>
                                    <div className="com-text">
                                        <span>Zor kitob</span>
                                    </div>
                                    <div className="do-com">
                                        <span>Книга легко читается, полезна для всех областей жизни человека. Становится настольной, особенно в минуты, когда «руки опускаются» перечитываешь некоторые моменты и вновь находишь в себе силы и желание работать, жить, любить,общаться с ребёнком, поддерживать родителей. </span>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className="leaveotziv-container">
                        <div className="otziv-btn">
                            <button onClick={()=>{setShow(true)}}>Оставить отзыв</button>
                            <div className="otz-rate">
                                <h4>Отзывы с оценкой</h4>
                                <div className="star-rate">
                                    <div className="star-5">
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                    </div>
                                    <span>13 отзывов</span>
                                </div>
                                <div className="star-rate">
                                    <div className="star-5">
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                    </div>
                                    <span>10 отзывов</span>
                                </div>
                                <div className="star-rate">
                                    <div className="star-5">
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                    </div>
                                    <span>10 отзывов</span>
                                </div>
                                <div className="star-rate">
                                    <div className="star-5">
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                    </div>
                                    <span>10 отзывов</span>
                                </div>
                                <div className="star-rate">
                                    <div className="star-5">
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M2.99621 13.8951C3.26117 14.0763 3.58132 14.0194 3.97324 13.7502L7.81514 11.1099L11.657 13.7502C12.049 14.0194 12.3746 14.0763 12.6341 13.8951C12.888 13.7139 12.9487 13.4137 12.7942 12.9788L11.2872 8.74399L15.1567 6.13477C15.5486 5.87074 15.7032 5.59636 15.5983 5.30645C15.4989 5.02689 15.2119 4.87676 14.7151 4.88193L9.96793 4.90782L8.51618 0.657482C8.36714 0.217435 8.1353 0 7.81514 0C7.49498 0 7.26314 0.217435 7.11411 0.657482L5.66235 4.90782L0.915179 4.88193C0.423901 4.87676 0.131343 5.02689 0.0319833 5.30645C-0.0728962 5.59636 0.081663 5.87074 0.473581 6.13477L4.34308 8.74399L2.84165 12.9788C2.68157 13.4137 2.74229 13.7139 2.99621 13.8951Z" fill="#F5921C"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M8.55123 10.6992L8.26602 10.5011L7.98082 10.6992L4.17903 13.3394C4.179 13.3394 4.17897 13.3395 4.17894 13.3395C4.0178 13.4513 3.91322 13.4886 3.85591 13.4976C3.81907 13.5034 3.80432 13.4988 3.78589 13.4867C3.77235 13.4764 3.76794 13.4698 3.7668 13.468C3.76577 13.4664 3.76233 13.4609 3.75968 13.4458C3.75348 13.4104 3.75224 13.3198 3.81414 13.1499L3.81417 13.1499L3.81614 13.1443L5.30193 8.90952L5.42909 8.54709L5.11168 8.3308L1.28249 5.72158L1.28231 5.72146C1.12228 5.61251 1.0595 5.53286 1.03895 5.49445C1.03552 5.48804 1.0337 5.48361 1.03278 5.48097C1.03315 5.47956 1.03375 5.47759 1.03468 5.47497L1.03469 5.47497L1.03561 5.47234C1.03579 5.47185 1.03595 5.47135 1.03613 5.47082C1.03855 5.46349 1.04203 5.45294 1.07691 5.43572C1.12759 5.41069 1.23561 5.37981 1.43261 5.38191L1.43518 5.38192L6.1329 5.40781L6.49378 5.4098L6.60933 5.06792L8.04596 0.817586L8.04637 0.816375C8.1053 0.640554 8.16482 0.559589 8.1996 0.526632C8.22218 0.50523 8.23567 0.5 8.26602 0.5C8.29637 0.5 8.30986 0.50523 8.33245 0.526632C8.36722 0.559589 8.42675 0.640554 8.48567 0.816376L8.48608 0.817585L9.92271 5.06792L10.0383 5.4098L10.3991 5.40781L15.0969 5.38193L15.0994 5.3819C15.3 5.37979 15.4073 5.41095 15.4563 5.4353C15.4893 5.45167 15.4926 5.46134 15.4959 5.47081C15.4961 5.47132 15.4962 5.47183 15.4964 5.47235L15.4974 5.47497C15.4983 5.47759 15.4989 5.47956 15.4993 5.48097C15.4983 5.48361 15.4965 5.48804 15.4931 5.49445C15.4725 5.53286 15.4098 5.61251 15.2497 5.72146L15.2496 5.72158L11.4204 8.3308L11.1026 8.54734L11.2303 8.91007L12.7215 13.1447C12.7815 13.3152 12.7801 13.4067 12.7734 13.4437C12.7706 13.4596 12.7669 13.4656 12.7656 13.4676C12.7642 13.4698 12.7593 13.4771 12.7442 13.4882C12.7304 13.4977 12.7178 13.5038 12.6779 13.4976C12.6192 13.4884 12.5131 13.4505 12.353 13.3394L8.55123 10.6992Z" stroke="#D2D2D2"/>
                                        </svg>
                                    </div>
                                    <span>10 отзывов</span>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <OtzivModal show={show} onClose={()=>{setShow(false)}}/>
        </>
    )
}

export default Product